; domain
(define (domain ricochet-robots)
(:requirements :typing :adl :action-costs)

(:types
    robot - object
    cell - object
    direction - object
)

(:predicates
    ;; ?cnext is right next to ?c in the direction of ?dir
    (NEXT ?c - cell ?cnext - cell ?dir - direction)
    ;; moving from ?c in the direction ?dir is blocked
    (BLOCKED ?c - cell ?dir - direction)
    ;; Robot ?r is located in the cell ?c
    (at ?r - robot ?c - cell)
    ;; No robot is located in the cell ?c
    (free ?c - cell)
    ;; No robot is moving anywhere
    (nothing-is-moving)
    ;; Robot ?r is moving in the direction ?dir
    (is-moving ?r - robot ?dir - direction)
)

(:functions
    (total-cost) - number

    ;; The costs of actions are configurable.
    ;; If we want to count only the number of movements of robots instead of
    ;; counting all steps from a cell to cell (as it would be in the real
    ;; game), then we need to set
    ;;      (= (go-cost) 1)
    ;;      (= (step-cost) 0)
    ;;      (= (stop-cost) 0)
    (go-cost) - number
    (step-cost) - number
    (stop-cost) - number
)

;; Starts movement of the robot ?r in the direction ?dir
(:action go
    :parameters (?r - robot ?dir - direction)
    :precondition
        (and
            (nothing-is-moving)

            ;; If we want to make sure that the robot can actually make a step
            ;; in the specified direction, then we need to add the following
            ;; (and the corresponding parameters ?cfrom and ?cto):
            ;;
            ;; (at ?r ?cfrom)
            ;; (NEXT ?cfrom ?cto ?dir)
            ;; (free ?cto)
            ;; (not (BLOCKED ?cfrom ?dir))
        )
    :effect
        (and
            (not (nothing-is-moving))
            (is-moving ?r ?dir)
            (increase (total-cost) (go-cost))
        )
)

;; Make one step from the cell ?cfrom to the cell ?cto with the robot ?r
;; Robot is allowed to make the step only if it is the (only) one currently
;; moving, and it is moving in the direction ?dir
(:action step
    :parameters (?r - robot ?cfrom - cell ?cto - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?dir)
            (at ?r ?cfrom)
            (NEXT ?cfrom ?cto ?dir)
            (free ?cto)
            (not (BLOCKED ?cfrom ?dir))
        )
    :effect
        (and
            (not (at ?r ?cfrom))
            (free ?cfrom)
            (not (free ?cto))
            (at ?r ?cto)
            (increase (total-cost) (step-cost))
        )
)

;; Stopping of the robot is split between
;; (i) stop-at-barrier which stops the robot if it cannot move further due to
;;     a barrier expressed with (BLOCKED ...) predicate
;; (ii) stop-at-robot which stops the robot if the next step is blocked by
;;      another robot
(:action stop-at-barrier
    :parameters (?r - robot ?cat - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?dir)
            (at ?r ?cat)
            (BLOCKED ?cat ?dir)
        )
    :effect
        (and
            (not (is-moving ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)

(:action stop-at-robot
    :parameters (?r - robot ?cat - cell ?cnext - cell ?dir - direction)
    :precondition
        (and
            (is-moving ?r ?dir)
            (at ?r ?cat)
            (NEXT ?cat ?cnext ?dir)
            (not (free ?cnext))
        )
    :effect
        (and
            (not (is-moving ?r ?dir))
            (nothing-is-moving)
            (increase (total-cost) (stop-cost))
        )
)
)

; problem
;; Generated from file generate-9904.asp from the ASP competition 2015
;;
;; +xx+xx+xx+xx+xx+xx+xx+xx+xx+
;; x  |  |  |  |R3|  |  |  |  x
;; +xx+--+--+--+--+--+--+--+--+
;; x  |  |  |  |  |  |  |  |  x
;; +--+--+--+--+--+--+--+--+xx+
;; x  |  |  |  x  x  |  |  |  x
;; +--+--+--+--+xx+--+--+--+--+
;; x  |  x  |  |  |  |  |  x  x
;; +--+--+--+--+--+--+--+--+xx+
;; x  |  |  |  |  |  |  |  |  x
;; +--+--+--+xx+--+--+--+--+--+
;; x  |  |  |  |  |  |  |R4|  x
;; +--+--+--+xx+--+--+--+--+--+
;; x  |  |  |  |  x  |  |  |  x
;; +--+--+--+xx+--+xx+--+--+--+
;; x  |  |  |  |  |  |  |  xG3x
;; +--+xx+--+--+--+--+xx+--+--+
;; x  |  |  |  |  |R1|R2|  |  x
;; +xx+xx+xx+xx+xx+xx+xx+xx+xx+

(define (problem ricochet-robots-9x9-None-277472)
(:domain ricochet-robots)

(:objects
    DUMMY1 DUMMY2 DUMMY3 DUMMY4 DUMMY5 DUMMY6 DUMMY7 DUMMY8 DUMMY9 cell-1-1 cell-1-2 cell-1-3 cell-1-4 cell-1-5 cell-1-6 cell-1-7 cell-1-8 cell-1-9 cell-2-1 cell-2-2 cell-2-3 cell-2-4 cell-2-5 cell-2-6 cell-2-7 cell-2-8 cell-2-9 cell-3-1 cell-3-2 cell-3-3 cell-3-4 cell-3-5 cell-3-6 cell-3-7 cell-3-8 cell-3-9 cell-4-1 cell-4-2 cell-4-3 cell-4-4 cell-4-5 cell-4-6 cell-4-7 cell-4-8 cell-4-9 cell-5-1 cell-5-2 cell-5-3 cell-5-4 cell-5-5 cell-5-6 cell-5-7 cell-5-8 cell-5-9 cell-6-1 cell-6-2 cell-6-3 cell-6-4 cell-6-5 cell-6-6 cell-6-7 cell-6-8 cell-6-9 cell-7-1 cell-7-2 cell-7-3 cell-7-4 cell-7-5 cell-7-6 cell-7-7 cell-7-8 cell-7-9 cell-8-1 cell-8-2 cell-8-3 cell-8-4 cell-8-5 cell-8-6 cell-8-7 cell-8-8 cell-8-9 cell-9-1 cell-9-2 cell-9-3 cell-9-4 cell-9-5 cell-9-6 cell-9-7 cell-9-8 cell-9-9 - cell
    robot-1 robot-2 robot-3 robot-4 - robot
    west east north south - direction
)

(:init
    (NEXT cell-1-1 cell-1-2 south)
    (NEXT cell-1-2 cell-1-3 south)
    (NEXT cell-1-3 cell-1-4 south)
    (NEXT cell-1-4 cell-1-5 south)
    (NEXT cell-1-5 cell-1-6 south)
    (NEXT cell-1-6 cell-1-7 south)
    (NEXT cell-1-7 cell-1-8 south)
    (NEXT cell-1-8 cell-1-9 south)
    (NEXT cell-2-1 cell-2-2 south)
    (NEXT cell-2-2 cell-2-3 south)
    (NEXT cell-2-3 cell-2-4 south)
    (NEXT cell-2-4 cell-2-5 south)
    (NEXT cell-2-5 cell-2-6 south)
    (NEXT cell-2-6 cell-2-7 south)
    (NEXT cell-2-7 cell-2-8 south)
    (NEXT cell-2-8 cell-2-9 south)
    (NEXT cell-3-1 cell-3-2 south)
    (NEXT cell-3-2 cell-3-3 south)
    (NEXT cell-3-3 cell-3-4 south)
    (NEXT cell-3-4 cell-3-5 south)
    (NEXT cell-3-5 cell-3-6 south)
    (NEXT cell-3-6 cell-3-7 south)
    (NEXT cell-3-7 cell-3-8 south)
    (NEXT cell-3-8 cell-3-9 south)
    (NEXT cell-4-1 cell-4-2 south)
    (NEXT cell-4-2 cell-4-3 south)
    (NEXT cell-4-3 cell-4-4 south)
    (NEXT cell-4-4 cell-4-5 south)
    (NEXT cell-4-5 cell-4-6 south)
    (NEXT cell-4-6 cell-4-7 south)
    (NEXT cell-4-7 cell-4-8 south)
    (NEXT cell-4-8 cell-4-9 south)
    (NEXT cell-5-1 cell-5-2 south)
    (NEXT cell-5-2 cell-5-3 south)
    (NEXT cell-5-3 cell-5-4 south)
    (NEXT cell-5-4 cell-5-5 south)
    (NEXT cell-5-5 cell-5-6 south)
    (NEXT cell-5-6 cell-5-7 south)
    (NEXT cell-5-7 cell-5-8 south)
    (NEXT cell-5-8 cell-5-9 south)
    (NEXT cell-6-1 cell-6-2 south)
    (NEXT cell-6-2 cell-6-3 south)
    (NEXT cell-6-3 cell-6-4 south)
    (NEXT cell-6-4 cell-6-5 south)
    (NEXT cell-6-5 cell-6-6 south)
    (NEXT cell-6-6 cell-6-7 south)
    (NEXT cell-6-7 cell-6-8 south)
    (NEXT cell-6-8 cell-6-9 south)
    (NEXT cell-7-1 cell-7-2 south)
    (NEXT cell-7-2 cell-7-3 south)
    (NEXT cell-7-3 cell-7-4 south)
    (NEXT cell-7-4 cell-7-5 south)
    (NEXT cell-7-5 cell-7-6 south)
    (NEXT cell-7-6 cell-7-7 south)
    (NEXT cell-7-7 cell-7-8 south)
    (NEXT cell-7-8 cell-7-9 south)
    (NEXT cell-8-1 cell-8-2 south)
    (NEXT cell-8-2 cell-8-3 south)
    (NEXT cell-8-3 cell-8-4 south)
    (NEXT cell-8-4 cell-8-5 south)
    (NEXT cell-8-5 cell-8-6 south)
    (NEXT cell-8-6 cell-8-7 south)
    (NEXT cell-8-7 cell-8-8 south)
    (NEXT cell-8-8 cell-8-9 south)
    (NEXT cell-9-1 cell-9-2 south)
    (NEXT cell-9-2 cell-9-3 south)
    (NEXT cell-9-3 cell-9-4 south)
    (NEXT cell-9-4 cell-9-5 south)
    (NEXT cell-9-5 cell-9-6 south)
    (NEXT cell-9-6 cell-9-7 south)
    (NEXT cell-9-7 cell-9-8 south)
    (NEXT cell-9-8 cell-9-9 south)
    (NEXT cell-1-9 cell-1-8 north)
    (NEXT cell-1-8 cell-1-7 north)
    (NEXT cell-1-7 cell-1-6 north)
    (NEXT cell-1-6 cell-1-5 north)
    (NEXT cell-1-5 cell-1-4 north)
    (NEXT cell-1-4 cell-1-3 north)
    (NEXT cell-1-3 cell-1-2 north)
    (NEXT cell-1-2 cell-1-1 north)
    (NEXT cell-2-9 cell-2-8 north)
    (NEXT cell-2-8 cell-2-7 north)
    (NEXT cell-2-7 cell-2-6 north)
    (NEXT cell-2-6 cell-2-5 north)
    (NEXT cell-2-5 cell-2-4 north)
    (NEXT cell-2-4 cell-2-3 north)
    (NEXT cell-2-3 cell-2-2 north)
    (NEXT cell-2-2 cell-2-1 north)
    (NEXT cell-3-9 cell-3-8 north)
    (NEXT cell-3-8 cell-3-7 north)
    (NEXT cell-3-7 cell-3-6 north)
    (NEXT cell-3-6 cell-3-5 north)
    (NEXT cell-3-5 cell-3-4 north)
    (NEXT cell-3-4 cell-3-3 north)
    (NEXT cell-3-3 cell-3-2 north)
    (NEXT cell-3-2 cell-3-1 north)
    (NEXT cell-4-9 cell-4-8 north)
    (NEXT cell-4-8 cell-4-7 north)
    (NEXT cell-4-7 cell-4-6 north)
    (NEXT cell-4-6 cell-4-5 north)
    (NEXT cell-4-5 cell-4-4 north)
    (NEXT cell-4-4 cell-4-3 north)
    (NEXT cell-4-3 cell-4-2 north)
    (NEXT cell-4-2 cell-4-1 north)
    (NEXT cell-5-9 cell-5-8 north)
    (NEXT cell-5-8 cell-5-7 north)
    (NEXT cell-5-7 cell-5-6 north)
    (NEXT cell-5-6 cell-5-5 north)
    (NEXT cell-5-5 cell-5-4 north)
    (NEXT cell-5-4 cell-5-3 north)
    (NEXT cell-5-3 cell-5-2 north)
    (NEXT cell-5-2 cell-5-1 north)
    (NEXT cell-6-9 cell-6-8 north)
    (NEXT cell-6-8 cell-6-7 north)
    (NEXT cell-6-7 cell-6-6 north)
    (NEXT cell-6-6 cell-6-5 north)
    (NEXT cell-6-5 cell-6-4 north)
    (NEXT cell-6-4 cell-6-3 north)
    (NEXT cell-6-3 cell-6-2 north)
    (NEXT cell-6-2 cell-6-1 north)
    (NEXT cell-7-9 cell-7-8 north)
    (NEXT cell-7-8 cell-7-7 north)
    (NEXT cell-7-7 cell-7-6 north)
    (NEXT cell-7-6 cell-7-5 north)
    (NEXT cell-7-5 cell-7-4 north)
    (NEXT cell-7-4 cell-7-3 north)
    (NEXT cell-7-3 cell-7-2 north)
    (NEXT cell-7-2 cell-7-1 north)
    (NEXT cell-8-9 cell-8-8 north)
    (NEXT cell-8-8 cell-8-7 north)
    (NEXT cell-8-7 cell-8-6 north)
    (NEXT cell-8-6 cell-8-5 north)
    (NEXT cell-8-5 cell-8-4 north)
    (NEXT cell-8-4 cell-8-3 north)
    (NEXT cell-8-3 cell-8-2 north)
    (NEXT cell-8-2 cell-8-1 north)
    (NEXT cell-9-9 cell-9-8 north)
    (NEXT cell-9-8 cell-9-7 north)
    (NEXT cell-9-7 cell-9-6 north)
    (NEXT cell-9-6 cell-9-5 north)
    (NEXT cell-9-5 cell-9-4 north)
    (NEXT cell-9-4 cell-9-3 north)
    (NEXT cell-9-3 cell-9-2 north)
    (NEXT cell-9-2 cell-9-1 north)
    (NEXT cell-1-1 cell-2-1 east)
    (NEXT cell-2-1 cell-3-1 east)
    (NEXT cell-3-1 cell-4-1 east)
    (NEXT cell-4-1 cell-5-1 east)
    (NEXT cell-5-1 cell-6-1 east)
    (NEXT cell-6-1 cell-7-1 east)
    (NEXT cell-7-1 cell-8-1 east)
    (NEXT cell-8-1 cell-9-1 east)
    (NEXT cell-1-2 cell-2-2 east)
    (NEXT cell-2-2 cell-3-2 east)
    (NEXT cell-3-2 cell-4-2 east)
    (NEXT cell-4-2 cell-5-2 east)
    (NEXT cell-5-2 cell-6-2 east)
    (NEXT cell-6-2 cell-7-2 east)
    (NEXT cell-7-2 cell-8-2 east)
    (NEXT cell-8-2 cell-9-2 east)
    (NEXT cell-1-3 cell-2-3 east)
    (NEXT cell-2-3 cell-3-3 east)
    (NEXT cell-3-3 cell-4-3 east)
    (NEXT cell-4-3 cell-5-3 east)
    (NEXT cell-5-3 cell-6-3 east)
    (NEXT cell-6-3 cell-7-3 east)
    (NEXT cell-7-3 cell-8-3 east)
    (NEXT cell-8-3 cell-9-3 east)
    (NEXT cell-1-4 cell-2-4 east)
    (NEXT cell-2-4 cell-3-4 east)
    (NEXT cell-3-4 cell-4-4 east)
    (NEXT cell-4-4 cell-5-4 east)
    (NEXT cell-5-4 cell-6-4 east)
    (NEXT cell-6-4 cell-7-4 east)
    (NEXT cell-7-4 cell-8-4 east)
    (NEXT cell-8-4 cell-9-4 east)
    (NEXT cell-1-5 cell-2-5 east)
    (NEXT cell-2-5 cell-3-5 east)
    (NEXT cell-3-5 cell-4-5 east)
    (NEXT cell-4-5 cell-5-5 east)
    (NEXT cell-5-5 cell-6-5 east)
    (NEXT cell-6-5 cell-7-5 east)
    (NEXT cell-7-5 cell-8-5 east)
    (NEXT cell-8-5 cell-9-5 east)
    (NEXT cell-1-6 cell-2-6 east)
    (NEXT cell-2-6 cell-3-6 east)
    (NEXT cell-3-6 cell-4-6 east)
    (NEXT cell-4-6 cell-5-6 east)
    (NEXT cell-5-6 cell-6-6 east)
    (NEXT cell-6-6 cell-7-6 east)
    (NEXT cell-7-6 cell-8-6 east)
    (NEXT cell-8-6 cell-9-6 east)
    (NEXT cell-1-7 cell-2-7 east)
    (NEXT cell-2-7 cell-3-7 east)
    (NEXT cell-3-7 cell-4-7 east)
    (NEXT cell-4-7 cell-5-7 east)
    (NEXT cell-5-7 cell-6-7 east)
    (NEXT cell-6-7 cell-7-7 east)
    (NEXT cell-7-7 cell-8-7 east)
    (NEXT cell-8-7 cell-9-7 east)
    (NEXT cell-1-8 cell-2-8 east)
    (NEXT cell-2-8 cell-3-8 east)
    (NEXT cell-3-8 cell-4-8 east)
    (NEXT cell-4-8 cell-5-8 east)
    (NEXT cell-5-8 cell-6-8 east)
    (NEXT cell-6-8 cell-7-8 east)
    (NEXT cell-7-8 cell-8-8 east)
    (NEXT cell-8-8 cell-9-8 east)
    (NEXT cell-1-9 cell-2-9 east)
    (NEXT cell-2-9 cell-3-9 east)
    (NEXT cell-3-9 cell-4-9 east)
    (NEXT cell-4-9 cell-5-9 east)
    (NEXT cell-5-9 cell-6-9 east)
    (NEXT cell-6-9 cell-7-9 east)
    (NEXT cell-7-9 cell-8-9 east)
    (NEXT cell-8-9 cell-9-9 east)
    (NEXT cell-9-1 cell-8-1 west)
    (NEXT cell-8-1 cell-7-1 west)
    (NEXT cell-7-1 cell-6-1 west)
    (NEXT cell-6-1 cell-5-1 west)
    (NEXT cell-5-1 cell-4-1 west)
    (NEXT cell-4-1 cell-3-1 west)
    (NEXT cell-3-1 cell-2-1 west)
    (NEXT cell-2-1 cell-1-1 west)
    (NEXT cell-9-2 cell-8-2 west)
    (NEXT cell-8-2 cell-7-2 west)
    (NEXT cell-7-2 cell-6-2 west)
    (NEXT cell-6-2 cell-5-2 west)
    (NEXT cell-5-2 cell-4-2 west)
    (NEXT cell-4-2 cell-3-2 west)
    (NEXT cell-3-2 cell-2-2 west)
    (NEXT cell-2-2 cell-1-2 west)
    (NEXT cell-9-3 cell-8-3 west)
    (NEXT cell-8-3 cell-7-3 west)
    (NEXT cell-7-3 cell-6-3 west)
    (NEXT cell-6-3 cell-5-3 west)
    (NEXT cell-5-3 cell-4-3 west)
    (NEXT cell-4-3 cell-3-3 west)
    (NEXT cell-3-3 cell-2-3 west)
    (NEXT cell-2-3 cell-1-3 west)
    (NEXT cell-9-4 cell-8-4 west)
    (NEXT cell-8-4 cell-7-4 west)
    (NEXT cell-7-4 cell-6-4 west)
    (NEXT cell-6-4 cell-5-4 west)
    (NEXT cell-5-4 cell-4-4 west)
    (NEXT cell-4-4 cell-3-4 west)
    (NEXT cell-3-4 cell-2-4 west)
    (NEXT cell-2-4 cell-1-4 west)
    (NEXT cell-9-5 cell-8-5 west)
    (NEXT cell-8-5 cell-7-5 west)
    (NEXT cell-7-5 cell-6-5 west)
    (NEXT cell-6-5 cell-5-5 west)
    (NEXT cell-5-5 cell-4-5 west)
    (NEXT cell-4-5 cell-3-5 west)
    (NEXT cell-3-5 cell-2-5 west)
    (NEXT cell-2-5 cell-1-5 west)
    (NEXT cell-9-6 cell-8-6 west)
    (NEXT cell-8-6 cell-7-6 west)
    (NEXT cell-7-6 cell-6-6 west)
    (NEXT cell-6-6 cell-5-6 west)
    (NEXT cell-5-6 cell-4-6 west)
    (NEXT cell-4-6 cell-3-6 west)
    (NEXT cell-3-6 cell-2-6 west)
    (NEXT cell-2-6 cell-1-6 west)
    (NEXT cell-9-7 cell-8-7 west)
    (NEXT cell-8-7 cell-7-7 west)
    (NEXT cell-7-7 cell-6-7 west)
    (NEXT cell-6-7 cell-5-7 west)
    (NEXT cell-5-7 cell-4-7 west)
    (NEXT cell-4-7 cell-3-7 west)
    (NEXT cell-3-7 cell-2-7 west)
    (NEXT cell-2-7 cell-1-7 west)
    (NEXT cell-9-8 cell-8-8 west)
    (NEXT cell-8-8 cell-7-8 west)
    (NEXT cell-7-8 cell-6-8 west)
    (NEXT cell-6-8 cell-5-8 west)
    (NEXT cell-5-8 cell-4-8 west)
    (NEXT cell-4-8 cell-3-8 west)
    (NEXT cell-3-8 cell-2-8 west)
    (NEXT cell-2-8 cell-1-8 west)
    (NEXT cell-9-9 cell-8-9 west)
    (NEXT cell-8-9 cell-7-9 west)
    (NEXT cell-7-9 cell-6-9 west)
    (NEXT cell-6-9 cell-5-9 west)
    (NEXT cell-5-9 cell-4-9 west)
    (NEXT cell-4-9 cell-3-9 west)
    (NEXT cell-3-9 cell-2-9 west)
    (NEXT cell-2-9 cell-1-9 west)

    (BLOCKED cell-1-1 north)
    (BLOCKED cell-1-9 south)
    (BLOCKED cell-2-1 north)
    (BLOCKED cell-2-9 south)
    (BLOCKED cell-3-1 north)
    (BLOCKED cell-3-9 south)
    (BLOCKED cell-4-1 north)
    (BLOCKED cell-4-9 south)
    (BLOCKED cell-5-1 north)
    (BLOCKED cell-5-9 south)
    (BLOCKED cell-6-1 north)
    (BLOCKED cell-6-9 south)
    (BLOCKED cell-7-1 north)
    (BLOCKED cell-7-9 south)
    (BLOCKED cell-8-1 north)
    (BLOCKED cell-8-9 south)
    (BLOCKED cell-9-1 north)
    (BLOCKED cell-9-9 south)
    (BLOCKED cell-1-1 west)
    (BLOCKED cell-9-1 east)
    (BLOCKED cell-1-2 west)
    (BLOCKED cell-9-2 east)
    (BLOCKED cell-1-3 west)
    (BLOCKED cell-9-3 east)
    (BLOCKED cell-1-4 west)
    (BLOCKED cell-9-4 east)
    (BLOCKED cell-1-5 west)
    (BLOCKED cell-9-5 east)
    (BLOCKED cell-1-6 west)
    (BLOCKED cell-9-6 east)
    (BLOCKED cell-1-7 west)
    (BLOCKED cell-9-7 east)
    (BLOCKED cell-1-8 west)
    (BLOCKED cell-9-8 east)
    (BLOCKED cell-1-9 west)
    (BLOCKED cell-9-9 east)
    (BLOCKED cell-3-4 west)
    (BLOCKED cell-2-4 east)
    (BLOCKED cell-2-8 south)
    (BLOCKED cell-2-9 north)
    (BLOCKED cell-5-4 north)
    (BLOCKED cell-5-3 south)
    (BLOCKED cell-9-3 north)
    (BLOCKED cell-9-2 south)
    (BLOCKED cell-4-7 south)
    (BLOCKED cell-4-8 north)
    (BLOCKED cell-4-7 north)
    (BLOCKED cell-4-6 south)
    (BLOCKED cell-1-1 south)
    (BLOCKED cell-1-2 north)
    (BLOCKED cell-8-8 east)
    (BLOCKED cell-9-8 west)
    (BLOCKED cell-4-5 south)
    (BLOCKED cell-4-6 north)
    (BLOCKED cell-5-3 east)
    (BLOCKED cell-6-3 west)
    (BLOCKED cell-8-4 east)
    (BLOCKED cell-9-4 west)
    (BLOCKED cell-7-9 north)
    (BLOCKED cell-7-8 south)
    (BLOCKED cell-5-7 east)
    (BLOCKED cell-6-7 west)
    (BLOCKED cell-4-3 east)
    (BLOCKED cell-5-3 west)
    (BLOCKED cell-9-4 south)
    (BLOCKED cell-9-5 north)
    (BLOCKED cell-6-7 south)
    (BLOCKED cell-6-8 north)

    (free cell-1-1)
    (free cell-1-2)
    (free cell-1-3)
    (free cell-1-4)
    (free cell-1-5)
    (free cell-1-6)
    (free cell-1-7)
    (free cell-1-8)
    (free cell-1-9)
    (free cell-2-1)
    (free cell-2-2)
    (free cell-2-3)
    (free cell-2-4)
    (free cell-2-5)
    (free cell-2-6)
    (free cell-2-7)
    (free cell-2-8)
    (free cell-2-9)
    (free cell-3-1)
    (free cell-3-2)
    (free cell-3-3)
    (free cell-3-4)
    (free cell-3-5)
    (free cell-3-6)
    (free cell-3-7)
    (free cell-3-8)
    (free cell-3-9)
    (free cell-4-1)
    (free cell-4-2)
    (free cell-4-3)
    (free cell-4-4)
    (free cell-4-5)
    (free cell-4-6)
    (free cell-4-7)
    (free cell-4-8)
    (free cell-4-9)
    (free cell-5-2)
    (free cell-5-3)
    (free cell-5-4)
    (free cell-5-5)
    (free cell-5-6)
    (free cell-5-7)
    (free cell-5-8)
    (free cell-5-9)
    (free cell-6-1)
    (free cell-6-2)
    (free cell-6-3)
    (free cell-6-4)
    (free cell-6-5)
    (free cell-6-6)
    (free cell-6-7)
    (free cell-6-8)
    (free cell-7-1)
    (free cell-7-2)
    (free cell-7-3)
    (free cell-7-4)
    (free cell-7-5)
    (free cell-7-6)
    (free cell-7-7)
    (free cell-7-8)
    (free cell-8-1)
    (free cell-8-2)
    (free cell-8-3)
    (free cell-8-4)
    (free cell-8-5)
    (free cell-8-7)
    (free cell-8-8)
    (free cell-8-9)
    (free cell-9-1)
    (free cell-9-2)
    (free cell-9-3)
    (free cell-9-4)
    (free cell-9-5)
    (free cell-9-6)
    (free cell-9-7)
    (free cell-9-8)
    (free cell-9-9)

    (at robot-1 cell-6-9) ;; red
    (at robot-2 cell-7-9) ;; blue
    (at robot-3 cell-5-1) ;; green
    (at robot-4 cell-8-6) ;; yellow

    (nothing-is-moving)

    (= (total-cost) 0)
    (= (go-cost) 1)
    (= (step-cost) 0)
    (= (stop-cost) 0)
)
(:goal
    (and
        (at robot-3 cell-9-8)
        (nothing-is-moving)
    )
)
(:metric minimize (total-cost))
)

; plan
1. (go robot-2 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-2 east)
   goals met: 0 of 2
2. (step robot-2 cell-7-9 cell-8-9 east)
   deleted: (at robot-2 cell-7-9) (free cell-8-9)
   added: (free cell-7-9) (at robot-2 cell-8-9)
   goals met: 0 of 2
3. (step robot-2 cell-8-9 cell-9-9 east)
   deleted: (at robot-2 cell-8-9) (free cell-9-9)
   added: (free cell-8-9) (at robot-2 cell-9-9)
   goals met: 0 of 2
4. (stop-at-barrier robot-2 cell-9-9 east)
   deleted: (is-moving robot-2 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
5. (go robot-1 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-1 east)
   goals met: 0 of 2
6. (step robot-1 cell-6-9 cell-7-9 east)
   deleted: (at robot-1 cell-6-9) (free cell-7-9)
   added: (free cell-6-9) (at robot-1 cell-7-9)
   goals met: 0 of 2
7. (step robot-1 cell-7-9 cell-8-9 east)
   deleted: (at robot-1 cell-7-9) (free cell-8-9)
   added: (free cell-7-9) (at robot-1 cell-8-9)
   goals met: 0 of 2
8. (stop-at-robot robot-1 cell-8-9 cell-9-9 east)
   deleted: (is-moving robot-1 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
9. (go robot-1 north)
   deleted: (nothing-is-moving)
   added: (is-moving robot-1 north)
   goals met: 0 of 2
10. (step robot-1 cell-8-9 cell-8-8 north)
   deleted: (at robot-1 cell-8-9) (free cell-8-8)
   added: (free cell-8-9) (at robot-1 cell-8-8)
   goals met: 0 of 2
11. (step robot-1 cell-8-8 cell-8-7 north)
   deleted: (at robot-1 cell-8-8) (free cell-8-7)
   added: (free cell-8-8) (at robot-1 cell-8-7)
   goals met: 0 of 2
12. (stop-at-robot robot-1 cell-8-7 cell-8-6 north)
   deleted: (is-moving robot-1 north)
   added: (nothing-is-moving)
   goals met: 1 of 2
13. (go robot-4 north)
   deleted: (nothing-is-moving)
   added: (is-moving robot-4 north)
   goals met: 0 of 2
14. (step robot-4 cell-8-6 cell-8-5 north)
   deleted: (at robot-4 cell-8-6) (free cell-8-5)
   added: (free cell-8-6) (at robot-4 cell-8-5)
   goals met: 0 of 2
15. (step robot-4 cell-8-5 cell-8-4 north)
   deleted: (at robot-4 cell-8-5) (free cell-8-4)
   added: (free cell-8-5) (at robot-4 cell-8-4)
   goals met: 0 of 2
16. (step robot-4 cell-8-4 cell-8-3 north)
   deleted: (at robot-4 cell-8-4) (free cell-8-3)
   added: (free cell-8-4) (at robot-4 cell-8-3)
   goals met: 0 of 2
17. (step robot-4 cell-8-3 cell-8-2 north)
   deleted: (at robot-4 cell-8-3) (free cell-8-2)
   added: (free cell-8-3) (at robot-4 cell-8-2)
   goals met: 0 of 2
18. (step robot-4 cell-8-2 cell-8-1 north)
   deleted: (at robot-4 cell-8-2) (free cell-8-1)
   added: (free cell-8-2) (at robot-4 cell-8-1)
   goals met: 0 of 2
19. (stop-at-barrier robot-4 cell-8-1 north)
   deleted: (is-moving robot-4 north)
   added: (nothing-is-moving)
   goals met: 1 of 2
20. (go robot-4 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-4 east)
   goals met: 0 of 2
21. (step robot-4 cell-8-1 cell-9-1 east)
   deleted: (at robot-4 cell-8-1) (free cell-9-1)
   added: (free cell-8-1) (at robot-4 cell-9-1)
   goals met: 0 of 2
22. (stop-at-barrier robot-4 cell-9-1 east)
   deleted: (is-moving robot-4 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
23. (go robot-3 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 east)
   goals met: 0 of 2
24. (step robot-3 cell-5-1 cell-6-1 east)
   deleted: (at robot-3 cell-5-1) (free cell-6-1)
   added: (free cell-5-1) (at robot-3 cell-6-1)
   goals met: 0 of 2
25. (step robot-3 cell-6-1 cell-7-1 east)
   deleted: (at robot-3 cell-6-1) (free cell-7-1)
   added: (free cell-6-1) (at robot-3 cell-7-1)
   goals met: 0 of 2
26. (step robot-3 cell-7-1 cell-8-1 east)
   deleted: (at robot-3 cell-7-1) (free cell-8-1)
   added: (free cell-7-1) (at robot-3 cell-8-1)
   goals met: 0 of 2
27. (stop-at-robot robot-3 cell-8-1 cell-9-1 east)
   deleted: (is-moving robot-3 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
28. (go robot-3 south)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 south)
   goals met: 0 of 2
29. (step robot-3 cell-8-1 cell-8-2 south)
   deleted: (at robot-3 cell-8-1) (free cell-8-2)
   added: (free cell-8-1) (at robot-3 cell-8-2)
   goals met: 0 of 2
30. (step robot-3 cell-8-2 cell-8-3 south)
   deleted: (at robot-3 cell-8-2) (free cell-8-3)
   added: (free cell-8-2) (at robot-3 cell-8-3)
   goals met: 0 of 2
31. (step robot-3 cell-8-3 cell-8-4 south)
   deleted: (at robot-3 cell-8-3) (free cell-8-4)
   added: (free cell-8-3) (at robot-3 cell-8-4)
   goals met: 0 of 2
32. (step robot-3 cell-8-4 cell-8-5 south)
   deleted: (at robot-3 cell-8-4) (free cell-8-5)
   added: (free cell-8-4) (at robot-3 cell-8-5)
   goals met: 0 of 2
33. (step robot-3 cell-8-5 cell-8-6 south)
   deleted: (at robot-3 cell-8-5) (free cell-8-6)
   added: (free cell-8-5) (at robot-3 cell-8-6)
   goals met: 0 of 2
34. (stop-at-robot robot-3 cell-8-6 cell-8-7 south)
   deleted: (is-moving robot-3 south)
   added: (nothing-is-moving)
   goals met: 1 of 2
35. (go robot-3 east)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 east)
   goals met: 0 of 2
36. (step robot-3 cell-8-6 cell-9-6 east)
   deleted: (at robot-3 cell-8-6) (free cell-9-6)
   added: (free cell-8-6) (at robot-3 cell-9-6)
   goals met: 0 of 2
37. (stop-at-barrier robot-3 cell-9-6 east)
   deleted: (is-moving robot-3 east)
   added: (nothing-is-moving)
   goals met: 1 of 2
38. (go robot-3 south)
   deleted: (nothing-is-moving)
   added: (is-moving robot-3 south)
   goals met: 0 of 2
39. (step robot-3 cell-9-6 cell-9-7 south)
   deleted: (at robot-3 cell-9-6) (free cell-9-7)
   added: (free cell-9-6) (at robot-3 cell-9-7)
   goals met: 0 of 2
40. (step robot-3 cell-9-7 cell-9-8 south)
   deleted: (at robot-3 cell-9-7) (free cell-9-8)
   added: (free cell-9-7) (at robot-3 cell-9-8)
   goals met: 1 of 2
41. (stop-at-robot robot-3 cell-9-8 cell-9-9 south)
   deleted: (is-moving robot-3 south)
   added: (nothing-is-moving)
   goals met: 2 of 2
